; Chinese (simplified) language file v3.8.0
; Author: Microsoft Translate, Fixed by Dave
bat_lang=zh_CN
codepage=936
error=错误！
startup_error1=Batch ApkTool 没有对文件夹的完全访问权限，或者安装路径包含无效字符
startup_error2=Batch ApkTool 没有写入文件夹的权限
previous_java1=您已经安装了 Java
previous_java2=Batch ApkTool 仅适用于 Java 8 或更高版本
get_java=在此处获取最新的 Java https://www.java.com/en/download/
java_notfound=Java 未找到
ON=是
OFF=否
MANUAL=手动
project=当前项目                                    
currentapk=已选 APK                                    
currentjar=已选 JAR                                    
apilevel=API 级别                                  
keepbroken=保留损坏的资源                            
buildexpert=在专家模式下构建                                                     
dontwritedebug=不写入调试信息到 smali                      
signafter=输出 APK 后签名                             
key=签名密钥                                  
openlog=查看日志                                                              
language=语言                                        
deodexall=Deodex 所有 APK 和 JAR                      
copy_deodexed_apk=复制 deodexed APK 到 _INPUT_APK             
copy_deodexed_jar=复制 deodexed JAR 到 _INPUT_JAR             
baksmaliapk=反编译 APK（仅 smali）
smaliapk=重新编译 APK
baksmalijar=反编译 JAR（仅 smali）
smalijar=重新编译 JAR
decompile=反编译 APK                                  
decompile_r=反编译 APK（仅资源）                        
recompile=重新编译 APK                                
signfiles=签名 APK 文件
zipalfiles=优化 APK 文件
viewsource=查看 Java 源代码
plugins=插件 >
selplugin=选择插件:
adbmenu=ADB:
devices=连接设备                                    
install=安装 APK >                                  
rootremount=root，重新挂载                              
pull=从设备提取 >                                
push=推送到设备 >                                
screenshot=屏幕截图                                    
screenrecord=屏幕录制视频
shell=打开终端
logs=查看日志 >
reboot=重启设备 >
info=设备信息
kill-server=结束服务
servicemenu=服务:
cleanup1=清除文件夹 _framework、_system              
cleanup2=清除文件夹 _INPUT_APK、_INPUT_JAR           
cleanup3=清除文件夹 _OUT_APK、_OUT_JAR
cleanup4=清除所有文件夹
exitmenu=退出
choosetask=请选择任务：
instframe=正在安装框架
instframe_error=安装框架出错
inputapk_empty=将要反编译的文件放到 _INPUT_APK 文件夹。有关详细信息，请参见 readme.txt。
decompiling=正在反编译
decompiling_error=反编译出错
recompiling=正在重新编译
recompiling_error=重新编译出错
orignotfound=错误！原始文件未找到。
backupnotfound=错误！_backup 文件夹未找到。
done=完成
signing=正在签名
signing_error=签名出错
doneerrors=完成有 ^!error_count^! 个错误。
zipal=正在优化
zipal_error=优化出错
selectviewer=选择 Java 源代码查看器：
cancel=取消
makechoice=请做出选择：
dragajd=将 APK、JAR 或 DEX 文件拖到此处：
genjava=正在生成 Java 代码
genjava_error=生成 Java 代码出错
apilevel_log=API 级别                    
buildexpert_log=在专家模式下构建            
signafter_log=签名输出 APK                
press1=按 ENTER 继续或输入 1 打开日志：
deletedialog=删除以下文件夹中的所有文件：
proceed=是否继续？
yes=是
selproj=选择项目：
createnewproj=创建新的项目
usedefproj=使用默认项目
inputprojname=输入项目名称：
selectapk=选择 APK：
allapks=_INPUT_APK 下的所有 APK
selectjar=选择 JAR：
alljars=_INPUT_JAR 下的所有 JAR
selectapktool=选择 APKTOOL：
selectsmali=选择 SMALI：
aversions=Android 版本
apilevels=API 级别       
enterapi=输入 API 级别：
invalidapi=无效的 API 级别^！
selectkey=选择密钥：
selectlang=选择语言：
framework_empty=将所有框架文件放在 _system\framework 文件夹中。有关详细信息，请参见 readme.txt。
deodexing=Deodexing
notodexed=文件未被 odexed。
smerror=smaling 出错
bsmerror=baksmaling 出错
bootnotfound=boot.oat 未发现
selectarch=选择 boot.oat 架构：
selectedarch=架构
extractboot=正在提取并 deodexing boot.oat...
extractboot_error=提取 boot.oat 出错
errorunp=解包出错
deodexing_error=deodexing 出错
baksmaling=正在反编译
smaling=正在回编译
connection_type=连接类型：
input_ip=输入设备 IP，例如 192.168.1.3：
input_ip2=输入设备 IP 或按 ENTER 键使用最后一个 IP
installtodef=安装到默认内存：
singlefile=单个文件
allfrom=所有文件
installtosd=安装到 SD 卡：
dragtoinstall=将 APK 拖到此处进行安装：
installing=正在安装
pull2=提取：
pushto=推送到
dragtopush=将要推送的文件拖到此处：
screensavedto=屏幕截图保存到文件
closetostop=关闭此窗口以停止录制
scrrecsavedto=屏幕录制保存到文件
logcatr=接收器
logcate=事件
toscreen=显示并保存到文件
tofile=保存到文件
bugreport=错误报告：
inlinetable=内联方法表：
saved_to_file=日志保存到文件
android_version=Android 版本：
brand=品牌：
model=型号：
reboot2=重启：
reboot3=重启
rebootto=重启到
symlinks=符号链接
copied_files=已复制文件：
old_smali_used=要 deodexing 请选择 smali 2.2 或更高版本
already_deodexed=文件已经 deodexed。
onefrom=单个文件
alt_method=替代方法
tool_for_deodex=用于 deodexing Android 6.x-7.x 的工具                                 
del_symlinks=执行 deodexing 后删除符号链接                                         
rewrite_opt=在反编译之前警告覆盖文件夹                                            
warn_rewrite1=发现带有反编译应用程序的文件夹
warn_rewrite2=输入 1 重写文件夹或按 ENTER 取消：
sound_opt=声音通知                                                              
manifest_opt=保存原始 AndroidManifest.xml                                          
AUTO=自动
AUTO+=自动+
necessary_files_missing=Batch ApkTool 的进一步工作是不可能的，因为缺少一个或多个必要的文件
dex_notfound=该文件不包含 classes.dex，必须在反编译之前对其进行 deodexed。
elapsed_time=持续时间
elapsed_h=时
elapsed_m=分
elapsed_s=秒
tool_for_deodex_vdex=用于 deodexing Android 8.x 的工具                                     
device_warning=要 deodexing Android 9.x，您需要通过 ADB 连接 device\emulator。连接它（菜单项 [10]）并再次开始 deodexing。
signing_scheme_opt=APK 签名方案                                                          
use_aapt_2=AAPT 版本                                                              
back_to_main_menu=返回到主菜单
set_postfix=不要覆盖，而是在输出文件名中添加序列号                                
dex_compression=.dex 文件的压缩级别                                                    
dex_compression_text=设置压缩级别（0 - 无压缩，9 - 最大压缩）
res_mode=解析资源模式                              
force_sign_v1=强制添加签名 v1                                                       
produce_v4_sign=另外创建 v4 签名文件 （.idsig）                                       
enable_expert_mode=打开专家模式                                                           
expert_mode_disabled=专家模式已停用